СкладГП/src/InformationRegisters/НазначенныеПодсборки/НазначенныеПодсборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НазначенныеПодсборки</name>
  <resources>
    <name>Место</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <attributes>
    <name>НомерСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пакет</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/InformationRegisters/ЗаданияНаВывозВПодсборки/ЗаданияНаВывозВПодсборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияНаВывозВПодсборки</name>
  <resources>
    <name>Подсборка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МассивИдПакетов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ПланДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БазаПУ</name>
    <type>
      <types>CatalogRef.БазыПУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаПогрузку</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/InformationRegisters/НазначенныеПодсборки/ManagerModule.bsl
Процедура ОбновитьРегистрПоЗаданиямНаВывоз() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданияНаВывозВПодсборки.Подсборка КАК Подсборка,
	|	ЗаданияНаВывозВПодсборки.МассивИдПакетов КАК МассивИдПакетов,
	|	ЗаданияНаВывозВПодсборки.НомерЗаявки КАК НомерЗаявки,
	|	ЗаданияНаВывозВПодсборки.Покупатель КАК Покупатель,
	|	ЗаданияНаВывозВПодсборки.Комментарий КАК Комментарий
	|ИЗ
	|	Константа.АдресПУ КАК АдресПУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияНаВывозВПодсборки КАК ЗаданияНаВывозВПодсборки
	|		ПО АдресПУ.Значение = ЗаданияНаВывозВПодсборки.БазаПУ
	|ГДЕ
	|	НЕ ЗаданияНаВывозВПодсборки.Выполнено";
	Выборка = Запрос.Выполнить().Выбрать();
	НЗ = РегистрыСведений.НазначенныеПодсборки.СоздатьНаборЗаписей();
	НЗ.Отбор.Склад.Установить(ОбщегоНазначенияВызовСервераПовтИсп.Склад());
	Пока Выборка.Следующий() Цикл 
		МассивИД = Выборка.МассивИдПакетов.Получить();
		Для Каждого ид из МассивИД Цикл
			Нов = НЗ.Добавить();
			Нов.Склад = ОбщегоНазначенияВызовСервераПовтИсп.Склад();
			Нов.Активность = Истина;
			Нов.Комментарий = Выборка.Комментарий;
			Нов.Покупатель = Выборка.Покупатель;
			Нов.НомерСпецификации = Выборка.НомерЗаявки;
			Нов.Пакет = Ид;
			Нов.Место = Выборка.Подсборка;
		КонецЦикла;
	КонецЦикла;
	НЗ.Записать(ИСТИНА);
КонецПроцедуры
